[
    {
        "id":19,
        "title": "New Website",
        "date": "May 10th, 2020",
        "content": "Hello World! Welcome to the brand new website! There is both a mobile and desktop version. Go Blue!"
    },
     {
        "id":18,
        "title": "First Crypto, Now Cororna",
        "date": "May 9th, 2020",
        "content": "Hey Wolverines! We hope that everyone is doing well during these unprecedented times. Prior to the COVID outbreak, the team was planning on competing at a tournament in Knoxville, TN. The team was excited to compete at an outdoor tournament, but it was unfortunately canceled due to social distancing orders. While the Michigan Water Polo team is still unsure how we had 2 seasons cut short due to contagious outbreaks, we are taking it in stride and looking forward to next year. Stay safe and Go Blue!"
    },
    
    {
        "id":17,
        "title": "End of Season",
        "date": "November 28th, 2019",
        "content": " Hey there Wolverines!\n \n After the conclusion of our season at Purdue University, we voted on 2020 Executive Board positions and Team Awards. The 2020 Executive Board has been posted to the website under about us and the team awards have been posted to the website under shcedule and results. Cheers to an unforgetable season!"
    },
    {
        "id":16,
        "title": "2019 Update",
        "date": "November 5th, 2019",
        "content": "We started practices in late August, working hard on our conditioning and fundamentals into the month of September. The weekend of September 20th, we travelled to East Lansing to take on Michigan State and Ohio State in the Spartan Invite preseason tune-up tournament. We lost to Michigan State in overtime, 10-9, and were defeated by the Buckeyes in a close one, 12-9\n\nIn the weeks that followed, our season took a dramatic turn. A parasitic outbreak at Canham Natatorium sidelined our team for over three weeks. During this time, we were unable to practice and were not allowed to travel to both the Big Ten east regional tournament at Michigan State and the Big Ten crossover tournament at Indiana due to concerns over cross-contamination, making our regular season record 0-0. We unfortunately were unable to host the Big Ten championship tournament at Canham as was originally scheduled due to this public health crisis.\n\nAfter our team was medically cleared, we travelled to Purdue University for the Big Ten championship tournament, where we were seeded fourth. We defeated Illinois in the first round, 13-5. In the semifinals, despite not having practiced in three weeks, we forced the number-one seed Michigan State to double overtime before eventually losing, 9-8. We finished the third place game with a 16-4 win over Wisconsin and thus concluded our season.\n\nUnfortunately, this marked our first season in five years that did not end with a Big Ten Championship. However, our boys showed a tremendous amount of grit and determination in what was truly a valiant effort. We plan on competing in several invitational tournaments this offseason, and will be even more hungry next year.\n\nWe would like to thank our fans for their support all season and send our seniors a thank you for all of their hard work over the past 4 seasons. Although this is a minor setback, one thing that we can say with confidence is that we will be back.\n\nGo Blue!"
    },
    {
        "id":15,
        "title": "Offseason Updates and Results!",
        "date": "April 28th, 2019",
        "content": "Hey there, Wolverines! It's been a while since our last update and even though finals are among us, a lot has happened since the end of last season!\n\nWe placed 8th at Nationals last fall in sunny Tuscon, Arizona! Results from the tournament are in our Results page.\n\nThis past winter, we competed at two offseason tournaments: the Wolverine Water Polo Masters Tournament in Ann Arbor and the Notre Dame Tournament in South Bend, Indiana. They were both a blast and we grew a lot together as a team!\n\nOur 2019 Executive Board has been elected, take a look underneath the Exec Board page. Congratulations to all of them!\n\nWe also had several Wolverines honored by the CWPA with All-Conference and All-American recognition for the 2018 season, as well as recognition from the team. The awards have been posted on the results and schedule page. Feel free go take a look!\n\nAs you can see, there is a lot to digest, but hopefully this will suffice. We would also like to thank and congratulate our upcoming graduates! We wish you guys the best in your future endeavors in life and appreciate everything you have done for Michigan Men's Water Polo.\n\nAs always, Go Blue and see you next fall!"
    }
    ,
    {
        "id":14,
        "title": "2018 CWPA Big Ten Champions",
        "date": "October 28th, 2018",
        "content": "Our months of preparation finally paid off, as we emerge the victors of the 2018 CWPA Big Ten Championships! We are thrilled to get back in the water and continue training in anticipation of Nationals at the University of Arizona in two weeks.\n\nBig thank you to all the parents, alumni, and fans that came through to support us this weekend. Go Blue, forever and always.\n\nLook out for pictures from the tournament, they should be uploaded to our Photo Gallery shortly. It can be found in the About Us section of the website."
    },
    {
        "id":13,
        "title": "2018 Season Has Begun",
        "date": "August 27th, 2018",
        "content": "Aaaaaand just like that we're back and our season is underway!\n\nThe 2017 season results have been archived and we have updated our schedule accordingly. As per usual our practices will be held from 9:00-11:00PM Monday - Thursday at Canham Natatorium with the exception of Aug 27 - Aug 30 during which they will be held from 6:30-8:30PM\n\nWe are thrilled to announce that we are hosting the Big Ten Championships on 10/27/2018 and 10/28/2018. That's right folks book your tickets ASAP because we are anticipating max-capacity."
    },
    {
        "id":12,
        "title": "2018 Team Update",
        "date": "May 14th, 2018",
        "content": "It's been a while since we've posted an article on the website, a lot has happened since the 2017 Big Ten Championship!\n\nWe placed 7th at Nationals! Scores and schedule can be found at the Results section of the website.\n\nTeam awards can also be found on the website\n\nWe are excited to announce that we have elected a new Exec Board for 2018! Find them at the Exec Board section of the website.\n\nWe played two offseason tournaments, one hosted by Wolverine Water Polo, in our own hometown, and one hosted by UNC, in Chapel Hill, North Carolina. They were both a ton of fun and we learned a lot!\n\nWe are looking forward to the 2018 season and preparing ourselves for the oppurtunity to defend our Big Ten Title. In conjunction with that, we have redevoloped the website to better accodomate you, our users and our fans, with increased readability and content. We have also started a photo gallery and archive, which can be found on the About Us section of our website which we hope will grow into a robust source of team information and history. As always, contact us with any team inquiries at the Contact Us section of the webisite, and Go Blue!"
    },
    {
        "id":11,
        "title": "2017 Big Ten Season + Championship Results",
        "date": "October 26th, 2017",
        "content": "After an exciting and undefeated regular season we are thrilled to announce that we have successfully defended our title as Big Ten Champions! You can find our scores from the tournament as well as the entire regular season in the tournament results page of this website.\n\nAs a result of this we have qualified for Nationals, hosted by Florida State University in Tallahassee, and will be attending from November 10th to November 12th for the third year in a row!"
    },
    {
        "id":10,
        "title": "Nationals Results",
        "date": "November 13th, 2016",
        "content": "We, your Wolverines finished off the weekend with a 4th place finish at the Men's National Collegiate Club Championship in South Bend, fighting until the end, but ultimately losing 8-6 to San Diego State University in our final game of the season.\n\nThe team would like to give a huge thanks to all of its fans, B1G Ten titles and 4th and 5th place national finishes in back-to-back years could not have been possible without your love and support throughout the season. We'll be back next year!\n\nGo Blue!"
    }
    ,
    {
        "id":9,
        "title": "Big Ten Tournament Results",
        "date": "October 31st, 2017",
        "content": "For Halloween this year, we were Big Ten Champions! We, your Michigan Men's Water Polo team, emerged victoriously over Northwestern, 8-3!\n\nWe now look forward to competing at Nationals in two weeks, in South Bend, Indiana, at the University of Notre Dame. We come in as the 5th seed, playing our first game against the 12th ranked Duke University. Stay tuned for updates and Go Blue!"
    }
    ,
    {
        "id":8,
        "title": "Regular Season Wrap-Up",
        "date": "October 18th, 2016",
        "content": "We, your U-M Men's Water Polo team finished the 2016 B1G regular season with 8-0 conference play record. We come into the Big Ten Division Championship tournament as the #1 seed--- set for October 29th-30th in Ann Arbor. Let's see how big of a maize and blue crowd we can get for the regular season B1G champions!"
    },
    {
        "id":7,
        "title": "B Team Update",
        "date": "August 30th, 2016",
        "content": "We, your U-M Men's Water Polo team finished the 2016 B1G regular season with 8-0 conference play record. We come into the Big Ten Division Championship tournament as the #1 seed--- set for October 29th-30th in Ann Arbor. Let's see how big of a maize and blue crowd we can get for the regular season B1G champions!"
    }
    ,
    {
        "id":6,
        "title": "Big Ten Champions!",
        "date": "October 25th, 2015",
        "content": "The Wolverines, earning the #1 seed at the Big Ten Tournament at Purdue this weekend with their perfect 8-0 regular season record, captured their first Big Ten Tournament title since 2012.\n\nCongratulations to all our hardworking players and coaching staff, and a special thank you to all our fans and parents, who made this season possible.\n\nThe Wolverines now look forward to Nationals, which are taking place in two weeks in California. Stay tuned for updates!"
    }
    ,
    {
        "id":5,
        "title": "Big Ten Tournament this Weekend",
        "date": "October 2nd, 2015",
        "content": "We are hosting a Big Ten tournament this weekend at Canham Natatorium. Attending will be all the current teams in the Big Ten. Our current schedule is located on the schedule and results tab of the website, as well as posted as an event on our Facebook page.\n\nHope you can come out to support us!"
    }
    ,
    {
        "id":4,
        "title": "Regular Season Begins",
        "date": "September 8th, 2015",
        "content": "Our regular season has begun, with practices being 9-11 P.M. Monday through Thursday at Canham Natatorium. If you have any questions or concerns, check out the About the Team tab or feel free to contact us through this webpage.Hope to see you soon!"
    }
    ,
    {
        "id":3,
        "title": "Final Preseason Practice Times",
        "date": "August 21st, 2015",
        "content": "The preseason is right around the corner and we have finalized practice times for the first two weeks of practice. We will hold two practices a day, one largely swimming in the afternoon, and one at night for water polo stuff.\n\nPractice in the afternoon: 2-3 at Skyline High school, get there around 1:30 so we can set up and change to be in the pool right on time.\n\nPractice at night: Our club sports overlords were kind enough to bump our practice time to 7-9 pm for the part of preseason. Be there with enough time to be changed and ready to get in by 7."
    },
    {
        "id":2,
        "title": "Buckeye Invite (9/5-9/6)",
        "date": "August 10th, 2015",
        "content": "We will be traveling to Ohio for the Buckeye Invite on September 5th and 6th and need to start putting together a roster. If you can go, put your name down on the sheet at the button below. If you are an incoming freshman, this is a great opportunity to meet the team! The roster will be first come first serve; however, those who show up to preseason practices will be considered before everyone else."
    }
    ,
    {
        "id":1,
        "title": "Preseason starting August 24th",
        "date": "July 31st, 2015",
        "content": "The 2015 preseason will begin with our first practice on August 24th from 9-11 P.M. at Canham Natatorium in Ann Arbor. If you're an incoming freshman and will not be in town by then, no need to worry, just contact us using the tab above so we know when you can join us.\n\nDirections to Canham can be found under the About tab. Parking is available in the back. Stay tuned for updates, and hope to see you all at the pool!"
    }
    ]